#include <stdio.h>
int main(void)
{
    int athlites_count = 8;            // Αριθμός των αθλητών
    float xronos_prin[athlites_count]; // Πίνακας που θα αποθηκεύει τους χρόνους πριν
    float xronos_meta[athlites_count]; // Πίνακας που θα αποθηκεύει τους χρόνους μετά

    // β.1

    for (int i = 0; i < athlites_count; i++)
    {
        do
        {
            printf("Δώσε τον χρόνο του %d-ου αθλητή (σε δευτερόλεπτα): ", i + 1);
            scanf("%f", &xronos_prin[i]); // Αποθήκευση του χρόνου πριν στον πίνακα στο σημείο i

            if (xronos_prin[i] >= 9.50 &&
                xronos_prin[i] <= 10.50) // Έλεγχος αν ο χρόνος είναι μεταξύ 9.50 και 10.50
            {
                break; // Ο χρόνος είναι αποδεκτός, βγες από το `do...while`.
            }
            else
            {
                printf("Ο χρόνος πρέπει να είναι μεταξύ 9.50 και 10.50 δευτερολέπτων.\n");
            }
        }
        while (1); // Επανάλαβε μέχρι να δοθεί σωστή τιμή.
    }

    for (int j = 0; j < athlites_count; j++)
    {
        do
        {
            printf("Δώσε τον χρόνο του %d-ου αθλητή (σε δευτερόλεπτα): ", j + 1);
            scanf("%f", &xronos_meta[j]); // Αποθήκευση του χρόνου μετά στον πίνακα στο σημείο j

            if (xronos_meta[j] >= 9.50 &&
                xronos_meta[j] <= 10.50) // Έλεγχος αν ο χρόνος είναι μεταξύ 9.50 και 10.50
            {
                break;
            }
            else
            {
                printf("Ο χρόνος πρέπει να είναι μεταξύ 9.50 και 10.50 δευτερολέπτων.\n");
            }
        }
        while (1); // Επανάλαβε μέχρι να δοθεί σωστή τιμή.
    }

    // β.2

    float kaluteros = 11; // Αρχικοποίηση του καλύτερου χρόνου πρίν με μια τιμή που δεν υπάρχει στον
                          // πίνακα ωστε να μπορεί να αλλάξει
    float xeiroteros = 9; // Αρχικοποίηση του χειρότερου χρόνου πρίν με μια τιμή που δεν υπάρχει
                          // στον πίνακα ωστε να μπορεί να αλλάξει
    for (int i = 0; i < athlites_count; i++)
    {
        if (xronos_prin[i] < kaluteros)
        {
            kaluteros = xronos_prin[i]; // Αν ο χρόνος είναι μικρότερος από τον καλύτερο χρόνο πρίν
                                        // τότε αυτός γίνεται ο νέος καλύτερος χρόνος πρίν
        }
        else // Αλλιώς ο χειρότερος χρόνος πρίν γίνεται ο χρόνος που είχε ο αθλητής
        {
            xeiroteros = xronos_prin[i];
        }
    }
    printf("Ο χειρότερος χρόνος πρίν είναι: %.2f\n",
           xeiroteros); // Εκτύπωση του χειρότερου χρόνου πρίν με ακριβεία 2 δεκαδικών ψηφίων
    printf("Ο καλύτερος χρόνος πρίν είναι: %.2f\n",
           kaluteros); // Εκτύπωση του καλύτερου χρόνου πρίν με ακριβεία 2 δεκαδικών ψηφίων

    // β.3

    int under = 0; // Αρχικοποίηση του πλήθους των αθλητών που είχαν χρόνο κάτω των 9.80
    for (int i = 0; i < athlites_count; i++)
    {
        if (xronos_meta[i] < 9.80)
        {
            under++; // Αύξηση του πλήθους των αθλητών που είχαν χρόνο κάτω των 9.80
        }
    }
    if (under == 0) // Αν κανένας αθλητής δεν είχε χρονο κάτω των 9.80 να τυπώνει
    {
        printf("Δεν υπάρχει κανένας με καλύτερο χρόνο κάτω του 9.80\n");
    }
    else
    { // Αλλιώς τυπώνει το πλήθος των αθλητών που είχαν χρόνο κάτω των 9.80
        printf("Το πλήθος των αθλητών με χρόνο καλύτερο απο 9.80 είναι: %i\n", under);
    }
    // β.4

    int max_index = -1;            // Αρχηκοποίηση τιμής που δεν υπάρχει ωστε να μπορεί να αλλάξει
    float max_improve = 0;         // Αρχικοποίηση τιμής της μεγαλύτερης βελτίωσης
    float improve[athlites_count]; // Πίνακας που θα αποθηκεύει τις βελτιώσεις των αθλητών

    for (int i = 0; i < athlites_count; i++)
    {
        improve[i] = xronos_prin[i] - xronos_meta[i]; // Διαφορά των χρόνων πριν και μετά
    }

    for (int i = 0; i < athlites_count; i++)
    { // Εύρεση της μεγαλύτερης βελτίωσης και του αντίστοιχου αθλητή
        if (max_improve < improve[i])
        {
            max_improve = improve[i];
            max_index = i; // Αποθήκευση του αθλητή που είχε την μεγαλύτερη βελτίωση
        }
    }

    if (max_index != -1)
    { // Αν υπάρχει αθλητής που βελτιώθηκε τυπώνεται το μήνυμα
        printf("Η μεγαλύτερη βελτίωση σημειώθηκε απο τον αθλητή %d, και ήταν %.2f δευτερόλεπτα\n",
               max_index + 1, max_improve);
    }
    else
    { // Αν κανένας αθλητής δεν βελτιώθηκε τυπώνεται το μήνυμα
        printf("Κανένας αθλητής δεν βελτιώθηκε");
    }
    return 0;
}
